Ran Plan for dir: `infra` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.12.1 plan -input=false -refresh -out "/atlantis-data/repos/ed-bogd/devops-task/16/default/infra/default.tfplan"' in '/atlantis-data/repos/ed-bogd/devops-task/16/default/infra': exit status 1
data.aws_caller_identity.current: Reading...
aws_eip.nat_1: Refreshing state... [id=eipalloc-0282c2cfbc2a5d06b]
aws_iam_policy.eks_admin_policy: Refreshing state... [id=arn:aws:iam::743683883645:policy/eks-admin-policy]
aws_iam_user.eks_admin: Refreshing state... [id=eks-admin-user]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
aws_iam_policy.eks_read_only_policy: Refreshing state... [id=arn:aws:iam::743683883645:policy/eks-read-only-policy]
module.eks.data.aws_caller_identity.current[0]: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0bea6400a7702f931]
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.data.aws_partition.current[0]: Reading...
aws_eip.nat_2: Refreshing state... [id=eipalloc-018bb83611ee28514]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=743683883645]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=743683883645]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/demo-cluster/cluster]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=demo-cluster-cluster-20250526053213135300000001]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=743683883645]
aws_iam_role.eks_read_only: Refreshing state... [id=eks-read-only]
aws_iam_role.eks_admin: Refreshing state... [id=eks-admin]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::743683883645:policy/demo-cluster-cluster-20250526053213324000000002]
aws_iam_access_key.eks_admin: Refreshing state... [id=AKIA22JYDQJ64XXWSYHT]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::743683883645:assumed-role/atlantis-demo-atlantis-role/1748240494695196231]
aws_subnet.public_2: Refreshing state... [id=subnet-0cd0878dd2b1b8ca3]
aws_subnet.private_1: Refreshing state... [id=subnet-0d64cd87c86dd3313]
aws_subnet.public_1: Refreshing state... [id=subnet-0a7b520ac8c0abd7c]
aws_internet_gateway.igw: Refreshing state... [id=igw-0e36c96041e17860b]
aws_subnet.private_2: Refreshing state... [id=subnet-0d3f7cb50af5dc567]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ad52db533a665bcb]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0cd2432f822d45b17]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=demo-cluster-cluster-20250526053213135300000001-20250526053214254600000003]
aws_route_table.public: Refreshing state... [id=rtb-098bd42c0b68ae574]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=demo-cluster-cluster-20250526053213135300000001-20250526053214261400000004]
aws_iam_role_policy_attachment.eks_read_only_custom: Refreshing state... [id=eks-read-only-20250526053956961900000001]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=demo-cluster-cluster-20250526053213135300000001-20250526053214262000000005]
aws_nat_gateway.nat_1: Refreshing state... [id=nat-0ba490ba9b890bdc0]
aws_iam_user_policy.eks_admin_assume_role: Refreshing state... [id=eks-admin-user:eks-admin-assume-role]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
aws_nat_gateway.nat_2: Refreshing state... [id=nat-0d5907dbd441e9789]
aws_iam_role_policy_attachment.eks_admin_role_policy: Refreshing state... [id=eks-admin-20250526053956969300000002]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=403817131]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1326665794]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1865137686]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-955146152]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2041497644]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1032680153]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1548708963]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1946608041]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-999247698]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1714237130]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2079724397]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=1cc62486-c4a4-4849-9282-437135ab66b5]
aws_route_table_association.public_1: Refreshing state... [id=rtbassoc-0187740e47f2fcec2]
aws_route_table.private_1: Refreshing state... [id=rtb-0f8423f3b19b0c296]
aws_route_table_association.public_2: Refreshing state... [id=rtbassoc-02253c5d34e0e8d56]
aws_route_table.private_2: Refreshing state... [id=rtb-0efc218f91cbde188]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1049916148]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=743683883645]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::743683883645:policy/demo-cluster-cluster-ClusterEncryption2025052605323509470000000e]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/demo-cluster]
aws_route_table_association.private_2: Refreshing state... [id=rtbassoc-0f8768d2e9f33761f]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250526053229469800000009]
aws_route_table_association.private_1: Refreshing state... [id=rtbassoc-0efd58a2d5387dc0f]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=demo-cluster]
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-05-26T05:50:11Z]
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-02ab4a05dabbd1964,Project]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-02ab4a05dabbd1964,Environment]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=demo-cluster:arn:aws:iam::743683883645:root]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::743683883645:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/73B240B8674237A959FA38EF17BF2048]
module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1962574778]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=demo-cluster-cluster-20250526053213135300000001-2025052605323574560000000f]
data.aws_iam_policy_document.atlantis_assume: Reading...
data.aws_iam_policy_document.atlantis_assume: Read complete after 0s [id=2988958715]
aws_iam_role.atlantis: Refreshing state... [id=atlantis-demo-atlantis-role]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["AmazonEBSCSIDriverPolicy"]: Refreshing state... [id=default-eks-node-group-20250526053229469800000009-2025052605323056450000000c]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250526053229469800000009-2025052605323024300000000b]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250526053229469800000009-2025052605323057350000000d]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250526053229469800000009-2025052605323024200000000a]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-017982ee6d811c12a]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=demo-cluster#arn:aws:iam::743683883645:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=demo-cluster:default-20250526055017439100000006]
aws_iam_role_policy_attachment.atlantis_attach: Refreshing state... [id=atlantis-demo-atlantis-role-20250526054943109800000003]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=demo-cluster:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=demo-cluster:vpc-cni]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=demo-cluster:coredns]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=demo-cluster:aws-ebs-csi-driver]
kubernetes_namespace.atlantis: Refreshing state... [id=atlantis]
module.eks_aws-auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "demo-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "eks" {
      + id    = (known after apply)
      + name  = "demo-cluster"
      + token = (sensitive value)
    }

  # aws_iam_access_key.eks_read_only will be created
  + resource "aws_iam_access_key" "eks_read_only" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eks-read-only-user"
    }

  # aws_iam_user.eks_read_only will be created
  + resource "aws_iam_user" "eks_read_only" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eks-read-only-user"
      + path          = "/"
      + tags          = {
          + "Name" = "eks-read-only"
        }
      + tags_all      = {
          + "Name" = "eks-read-only"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.eks_read_only_assume_role will be created
  + resource "aws_iam_user_policy" "eks_read_only_assume_role" {
      + id          = (known after apply)
      + name        = "eks-read-only-assume-role"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::743683883645:role/eks-read-only"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eks-read-only-user"
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.eu-central-1.amazonaws.com/id/73B240B8674237A959FA38EF17BF2048"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-central-1:743683883645:access-entry/demo-cluster/root/743683883645//72cb8591-df08-b149-341e-a1826d7e9d7b" -> (known after apply)
      ~ created_at        = "2025-05-26T05:49:41Z" -> (known after apply)
      ~ id                = "demo-cluster:arn:aws:iam::743683883645:root" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-05-26T05:49:41Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role" # forces replacement
        tags              = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
      ~ user_name         = "arn:aws:iam::743683883645:root" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-05-26 05:49:42.069 +0000 UTC" -> (known after apply)
      ~ id            = "demo-cluster#arn:aws:iam::743683883645:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-05-26 05:49:42.069 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.44.0-eksbuild.1" -> (known after apply)
        id                          = "demo-cluster:aws-ebs-csi-driver"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.11.4-eksbuild.14" -> (known after apply)
        id                          = "demo-cluster:coredns"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.32.3-eksbuild.7" -> (known after apply)
        id                          = "demo-cluster:kube-proxy"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.19.5-eksbuild.3" -> (known after apply)
        id                          = "demo-cluster:vpc-cni"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "demo-cluster"
        name                          = "demo-cluster"
        tags                          = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = (sensitive value)
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::743683883645:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/73B240B8674237A959FA38EF17BF2048"
        tags            = {
            "Environment" = "dev"
            "Name"        = "demo-cluster-eks-irsa"
            "Project"     = "atlantis-demo"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "1cc62486-c4a4-4849-9282-437135ab66b5"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:role/demo-cluster-cluster-20250526053213135300000001"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 5 to add, 7 to change, 2 to destroy.
╷
│ Error: namespaces "atlantis" is forbidden: User "system:serviceaccount:atlantis:atlantis" cannot get resource "namespaces" in API group "" in the namespace "atlantis"
│ 
│   with kubernetes_namespace.atlantis,
│   on atlantis.tf line 2, in resource "kubernetes_namespace" "atlantis":
│    2: resource "kubernetes_namespace" "atlantis" {
│ 
╵
╷
│ Error: configmaps "aws-auth" is forbidden: User "system:serviceaccount:atlantis:atlantis" cannot get resource "configmaps" in API group "" in the namespace "kube-system"
│ 
│   with module.eks_aws-auth.kubernetes_config_map_v1_data.aws_auth[0],
│   on .terraform/modules/eks_aws-auth/modules/aws-auth/main.tf line 31, in resource "kubernetes_config_map_v1_data" "aws_auth":
│   31: resource "kubernetes_config_map_v1_data" "aws_auth" {
│ 
╵


```
</details>